<?php
namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
{
$permissions = [
        'الصفحة الرئيسية',
        'قائمة الغرف',
        'قائمة الاقسام',
        'قائمة التخصصات',
        'قائمة الاطباء',
        'قائمة الممرضين',
        'قسم الاستقبال و الطوارئ',
        'قائمة المرضى',
        'املاك المستشفى',
        'قائمة المخازن',
        'قائمة الفواتير',
        'صلاحيات المستخدمين',
        'الاعدادات',
        'قائمة الصيدلية',
        'الاقسام',
        'غرف العمليات',
        'التسجيل',
        'قائمة المالية',
        'املاك المسشفى',
        'قائمة المساعدة',

        'المستخدمين',
        'حجز قسم الاشعه',
        'حجز العيادة الخارجية',

        'قائمة الحجوزات',
        'حجز موعد عمليه',
        'حجز غرفة جديدة',
        'حجز موعد مع طبيب',
        'حجز موعد مراجعه',
        'حجز موعد مراجعه اضافة',
        'تذكير بمواعيد المراجعه',
        'اضافة حجز اشعه',
        'اضافة قسم جديد',
        'اضافة غرفة جديدة',
        'وصول مريض جديد',

        'وصول مريض تعديل',
        'وصول مريض حذف',
        'وصول مريض عرض',


        'اضافة طبيب جديد',
        'تعديل طبيب ',
        'حذف طبيب ',
        'عرض طبيب ',

        'اضافة ممرض جديد',
        'اضافة مريض جديد',
        'اضافة وصول مريض جديد لقسم الطوارئ',
        'اضافة دواء جديد',
        'للمريض اضافة دواء جديد',
        'اضافة صنف في المخازن',
        'اضافة صنف في المخازن الصيدلية',
        'اضافة فاتورة جديدة',
        'اضافة ايصال جديد',


        'اضافة مستخدم',
        'تعديل مستخدم',
        'حذف مستخدم',
        'عرض صلاحية',
        'تعديل صلاحية',
        'حذف صلاحية',
        'اضافة صلاحية',

        'تعديل قسم',
        'حذف قسم',

        'تعديل غرفة',
        'حذف غرفة',

        'تعديل حجز غرفة جديدة',
        'حذف حجز غرفة جديدة',

        'اضافة تخصص',
        'تعديل تخصص',
        'حذف تخصص',



        'تعديل ممرض',
        'حذف ممرض',
        'عرض ممرض',

        'تعديل قسم الطوارئ',
        'حذف قسم الطوارئ',
        'عرض قسم الطوارئ',

        'تعديل مريض',
        'حذف مريض',
        'عرض مريض',

        'تعديل دواء',
        'حذف دواء',
        'عرض دواء',

        'تعديل دواء للمريض',
        'حذف دواء للمريض' ,
        'عرض دواء للمريض',

        'تعديل عمليه',
        'حذف عمليه',
        'عرض عمليه',


        'تعديل حجز موعد مع طبيب',
        'حذف حجز موعد مع طبيب',
        'عرض حجز موعد مع طبيب',


        'تعديل حجز موعد مراجعه',
        'حذف حجز موعد مراجعه',
        'عرض حجز موعد مراجعه',


        'تعديل حجز قسم الاشعه',
        'حذف حجز قسم الاشعه',


        'تعديل حجز عيادة خارجية',
        'حذف حجز عيادة خارجية',
        'عرض حجز عيادة خارجية',





];
foreach ($permissions as $permission) {
Permission::create(['name' => $permission]);
}
}
}
